#include <stdio.h>

void تبديل_العناصر(int *العنصر_الأول, int *العنصر_الثاني)
{
    int القيمة_المؤقتة = *العنصر_الأول;
    *العنصر_الأول = *العنصر_الثاني;
    *العنصر_الثاني = القيمة_المؤقتة;
}

int تقسيم_المصفوفة(int مصفوفة_الأرقام[], int مؤشر_منخفض, int مؤشر_عالي)
{
    int قيمة_المحور = مصفوفة_الأرقام[مؤشر_عالي];
    int فهرس_العنصر_الأصغر = مؤشر_منخفض - 1;

    for (int الفهرس_الحالي = مؤشر_منخفض; الفهرس_الحالي < مؤشر_عالي; الفهرس_الحالي++)
    {
        if (مصفوفة_الأرقام[الفهرس_الحالي] <= قيمة_المحور)
        {
            فهرس_العنصر_الأصغر++;
            تبديل_العناصر(&مصفوفة_الأرقام[فهرس_العنصر_الأصغر], &مصفوفة_الأرقام[الفهرس_الحالي]);
        }
    }
    تبديل_العناصر(&مصفوفة_الأرقام[فهرس_العنصر_الأصغر + 1], &مصفوفة_الأرقام[مؤشر_عالي]);
    return فهرس_العنصر_الأصغر + 1;
}

void فرز_سريع(int مصفوفة_الأرقام[], int مؤشر_منخفض, int مؤشر_عالي)
{
    if (مؤشر_منخفض < مؤشر_عالي)
    {
        int فهرس_المحور = تقسيم_المصفوفة(مصفوفة_الأرقام, مؤشر_منخفض, مؤشر_عالي);
        فرز_سريع(مصفوفة_الأرقام, مؤشر_منخفض, فهرس_المحور - 1);
        فرز_سريع(مصفوفة_الأرقام, فهرس_المحور + 1, مؤشر_عالي);
    }
}

int main()
{
    int أرقام[] = {10, 7, 8, 9, 1, 5};
    int طول_المصفوفة = 6;
    int فِهرِس;

    فرز_سريع(أرقام, 0, طول_المصفوفة - 1);

    printf("مصفوفة مرتبة: ");
    for (فِهرِس = 0; فِهرِس < طول_المصفوفة; فِهرِس++)
        printf("%d ", أرقام[فِهرِس]);
    printf("\n");
    return 0;
}
