def रैखिक_खोज(आइटम_सूची, लक्ष्य_मूल्य):
    """
    आइटम_सूची में हर एलिमेंट को एक के बाद एक चेक करके लक्ष्य_मूल्य खोजता है।
    अगर मिले तो लक्ष्य_मूल्य का इंडेक्स लौटाता है, या अगर नहीं है तो -1 लौटाता है।
    """
    वर्तमान_सूचकांक = 0
    while वर्तमान_सूचकांक < len(आइटम_सूची):
        वर्तमान_तत्व = आइटम_सूची[वर्तमान_सूचकांक]
        if वर्तमान_तत्व == लक्ष्य_मूल्य:
            return वर्तमान_सूचकांक
        वर्तमान_सूचकांक += 1
    return -1


if __name__ == "__main__":
    नंबर = [34, 7, 23, 32, 5, 62, 14, 89]
    लक्ष्य  = 32
    इंडेक्स = रैखिक_खोज(नंबर, लक्ष्य )
    if इंडेक्स != -1:
        print(f"मान {लक्ष्य}, इंडेक्स {इंडेक्स} पर मिला।")
    else:
        print(f"मान {लक्ष्य } नहीं मिला")
