#include <stdio.h>

void バブルソート(int 数値配列[], int 配列の要素数)
{
    /* バブルソートを使用して数値配列を昇順にソートします。 */
    int 外側ループ;
    int 内的ループ;
    int 退避用変数;
    int 入れ替えあり;

    for (外側ループ = 0; 外側ループ < 配列の要素数 - 1; 外側ループ++)
    {
        入れ替えあり = 0;
        for (内的ループ = 0; 内的ループ < 配列の要素数 - 外側ループ - 1; 内的ループ++)
        {
            if (数値配列[内的ループ] > 数値配列[内的ループ + 1])
            {
                /* 隣接する要素を交換する */
                退避用変数 = 数値配列[内的ループ];
                数値配列[内的ループ] = 数値配列[内的ループ + 1];
                数値配列[内的ループ + 1] = 退避用変数;
                入れ替えあり = 1;
            }
        }
        /* このパスでスワップが発生しなかった場合、配列は既にソートされています。 */
        if (入れ替えあり == 0)
            break;
    }
}

int main()
{
    int 数字[] = {64, 34, 25, 12, 22, 11, 90};
    int 配列の要素数 = 7;
    int 索引;

    バブルソート(数字, 配列の要素数);

    printf("整理済み配列: ");
    for (索引 = 0; 索引 < 配列の要素数; 索引++)
    {
        printf("%d ", 数字[索引]);
    }
    printf("\n");
    return 0;
}
