#include <stdio.h>

void الفرز_الفقاعي(int مصفوفة_الأرقام[], int مصفوفة_طول)
{
    /* فرز مصفوفة الأرقام بترتيب تصاعدي باستخدام فرز الفقاعات*/
    int ممر_خارجي;
    int داخلي_ممر;
    int مؤقت_قيمة;
    int تم_التبديل;

    for (ممر_خارجي = 0; ممر_خارجي < مصفوفة_طول - 1; ممر_خارجي++)
    {
        تم_التبديل = 0;
        for (داخلي_ممر = 0; داخلي_ممر < مصفوفة_طول - ممر_خارجي - 1; داخلي_ممر++)
        {
            if (مصفوفة_الأرقام[داخلي_ممر] > مصفوفة_الأرقام[داخلي_ممر + 1])
            {
                /* تبديل العناصر المتجاورة */
                مؤقت_قيمة = مصفوفة_الأرقام[داخلي_ممر];
                مصفوفة_الأرقام[داخلي_ممر] = مصفوفة_الأرقام[داخلي_ممر + 1];
                مصفوفة_الأرقام[داخلي_ممر + 1] = مؤقت_قيمة;
                تم_التبديل = 1;
            }
        }
        /* إذا لم يحدث تبديل في هذه المرحلة، فإن المصفوفة مرتبة بالفعل.*/
        if (تم_التبديل == 0)
            break;
    }
}

int main()
{
    int عددs[] = {64, 34, 25, 12, 22, 11, 90};
    int مصفوفة_طول = 7;
    int مؤشر;

    الفرز_الفقاعي(عددs, مصفوفة_طول);

    printf("تم_الفرز مصفوفة: ");
    for (مؤشر = 0; مؤشر < مصفوفة_طول; مؤشر++)
    {
        printf("%d ", عددs[مؤشر]);
    }
    printf("\n");
    return 0;
}