#include <stdio.h>

void 冒泡排序(int 数组[], int 数组长度)
{
    /* 使用冒泡排序对数组进行升序排序 */
    int 外轮;
    int 内轮;
    int 临时变量;
    int 是否有交换;

    for (外轮 = 0; 外轮 < 数组长度 - 1; 外轮++)
    {
        是否有交换 = 0;
        for (内轮 = 0; 内轮 < 数组长度 - 外轮 - 1; 内轮++)
        {
            if (数组[内轮] > 数组[内轮 + 1])
            {
                /* 是否有交换相邻元素 */
                临时变量 = 数组[内轮];
                数组[内轮] = 数组[内轮 + 1];
                数组[内轮 + 1] = 临时变量;
                是否有交换 = 1;
            }
        }
        /* 如果本次轮递过程中没有发生是否有交换，则数组已排序。 */
        if (是否有交换 == 0)
            break;
    }
}

int main()
{
    int 数字[] = {64, 34, 25, 12, 22, 11, 90};
    int 数组长度 = 7;
    int 索引;

    冒泡排序(数字, 数组长度);

    printf("已排序排列: ");
    for (索引 = 0; 索引 < 数组长度; 索引++)
    {
        printf("%d ", 数字[索引]);
    }
    printf("\n");
    return 0;
}
